////////////////////////////////////////////////////////////////////////////////
// Подсистема "Общие методы объектов".
//
// Процедуры и функции, выполнение которых может осуществляться как в контексте Сервера, так и в контексте Кликента.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// ЗаполнитьЗначенияСвойствОбъекта
// Заполняет значения реквизитов и табличных частей однотипных объектов информационной базы.
//
// Параметры:
//	Приемник			- Объект	- объект информационной базы, тип которого поддерживается механизмом Общих методов
//									(СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект и пр.) 
//									который будет заполнен данными источника.
//	СтруктураИсточник	- Структура	- структура реквизитов объекта, значения которых будут подставлены в объект
//	ОчищатьТЧ			- Булево	- Необязательный. Если Истина, перед добавлением строк в 
//						указанные в Структуре Источнике табличные части, последние будут очищены.
//	ТекстОшибки			- Строка	- Содержит описание ошибки, в случае возникновения оной.
//	Отказ				- Булево	- Признак возникновения ошибки выполнения.
//
Процедура ЗаполнитьЗначенияСвойствОбъекта(Приемник, СтруктураИсточник, ОчищатьТЧ = Истина, ТекстОшибки = "", Отказ = Ложь)Экспорт 

	ЗаполнитьЗначенияСвойств(Приемник, СтруктураИсточник);

	//Получение списка табличных частей
	ПолноеИмяМетаданныхОбъекта = Приемник.Метаданные().ПолноеИмя();
	МассивТабличныхЧастей = ОбщиеМетодыОбъектовВызовСервера.ТабличныеЧастиОбъекта(ПолноеИмяМетаданныхОбъекта, ТекстОшибки, Отказ);
	
	Если Не МассивТабличныхЧастей = Неопределено Тогда 
	
		//Заполнение табличных частей
		Для Каждого ИмяТабличнойЧасти Из МассивТабличныхЧастей Цикл
			Если СтруктураИсточник.Свойство(ИмяТабличнойЧасти) 
				И ТипЗнч(СтруктураИсточник[ИмяТабличнойЧасти]) = Тип("Массив")
				Тогда 
				
				Если ОчищатьТЧ Тогда 
					Приемник[ИмяТабличнойЧасти].Очистить();
				КонецЕсли;
				
				Для Каждого мСтруктураСтрокиТЧ Из СтруктураИсточник[ИмяТабличнойЧасти] Цикл 
					нСтрока = Приемник[ИмяТабличнойЧасти].Добавить();
					ЗаполнитьЗначенияСвойств(нСтрока, мСтруктураСтрокиТЧ);
				КонецЦикла;		
				
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
