////////////////////////////////////////////////////////////////////////////////
// Шаблон методов подсистемы для серверного модуля объекта
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщиеМетодыОбъектов

// СтруктураОбъекта
// Интерфейс для получения структуры всех реквизитов и табличных частей объекта на Сервере.
//
// Параметры:
//  СтруктураРеквизитовДляПоиска	- Структура - в качестве ключей передается имена реквизитов,
//  								в качестве значений (опционально) - значения реквизитов.
//  								- Строка - имена реквизитов, перечисленные через запятую.
//  ТекстОшибки						- Строка - содержит описание ошибки, в случае возникновения оной.
//  Отказ							- Булево - признак возникновения ошибки выполнения.
//
// Возвращаемое значение:
//  Структура			- описание объекта, в качестве ключа передаются имена реквизитов, а в качестве значений - значения реквизитов,
//  					реквизиты с именами табличных частей заполнены пустыми массивами.
//  Неопределено		- если не удалось получить объект метаданных по имени
//  					или найденный объект не поддерживается подсистемой.
//
Функция СтруктураОбъекта(СтруктураРеквизитовДляПоиска = Неопределено, ТекстОшибки = "", Отказ = Ложь) Экспорт
	
	// Перенаправка в модуль менеджера объекта
	Возврат ОбщиеМетодыОбъектов_ШаблонМодуляМенеджера.СтруктураОбъекта(СтруктураРеквизитовДляПоиска, ТекстОшибки, Отказ);
	
КонецФункции

// СтруктураСтрокиТабличнойЧастиОбъекта
// Интерфейс для получения структуры реквизитов табличной части объекта на Сервере.
//
// Параметры:
//  ИмяТабличнойЧасти	- Строка - имя табличной части.
//  ТекстОшибки			- Строка - содержит описание ошибки, в случае возникновения оной.
//  Отказ				- Булево - признак возникновения ошибки выполнения.
//
// Возвращаемое значение:
//  Структура			- имена и значения по умолчанию реквизитов табличной части.
//  Неопределено		- если не удалось получить объект метаданных или метаданные ТЧ по имени
//  					или найденный объект не поддерживается подсистемой.
//
Функция СтруктураСтрокиТабличнойЧастиОбъекта(ИмяТабличнойЧасти, ТекстОшибки = "", Отказ = Ложь) Экспорт
	
	// Перенаправка в модуль менеджера объекта
	Возврат ОбщиеМетодыОбъектов_ШаблонМодуляМенеджера.СтруктураСтрокиТабличнойЧастиОбъекта(ИмяТабличнойЧасти, ТекстОшибки, Отказ);
	
КонецФункции

// РеквизитыОбъекта
// Интерфейс для получения массива структур с именами и значениями реквизитов объектов, прочитанных из информационной базы, на Сервере.
//
// Параметры:
//  МассивСсылок		- Массив - коллекция из нескольких ДокументСсылка.споОплатаПРР, типы всех элементов массива должны совпадать.
//  					- ДокументСсылка.споОплатаПРР - ссылка на объект.
//  СтруктураРеквизитов	- Структура - в качестве ключей передаются имена реквизитов, значения которых необходимо получить.
//  					- Строка - имена реквизитов, перечисленные через запятую, значения которых необходимо получить.
//
// Возвращаемое значение:
//  Массив				- коллекция структур, содержащих реквизиты найденных объектов, если объекты не найдены, то массив будет пустым.
//  Неопределено		- в случае, если по полному имени не удалось найти объект метаданных
//  					или найденный объект не поддерживается подсистемой.
//
Функция РеквизитыОбъекта(МассивСсылок, СтруктураРеквизитов = Неопределено) Экспорт

	// Перенаправка в модуль менеджера объекта
	Возврат ОбщиеМетодыОбъектов_ШаблонМодуляМенеджера.РеквизитыОбъекта(МассивСсылок, СтруктураРеквизитов);
	
КонецФункции

// СоздатьОбъект
// Интерфейс для создания и записи объекта по переданной структуре параметров на Сервере.
//
// Параметры:
//  СтруктураОбъекта		- Структура - см. функцию ОбщиеМетодыОбъектовВызовСервера.СтруктураОбъекта.
//  ДополнительныеСвойства	- Структура - значения для заполнения одноименной структуры объекта,
//  						используется в случаях, когда необходимо хранить некоторые значения, связанные с объектом,
//  						на время выполнения некоторых операций, без изменения объекта.
//  ПараметрыЗаписи			- Структура - параметры для записи документов (режим записи и режим проведения).
//  ТекстОшибки				- Строка - содержит описание ошибки, в случае возникновения оной.
//  Отказ					- Булево - признак возникновения ошибки выполнения.
//
// Возвращаемое значение:
//  Ссылка			 		- ссылка на созданный объект.
//  Неопределено			- в случае ошибки записи.
//
Функция СоздатьОбъект(СтруктураОбъекта, ДополнительныеСвойства = Неопределено, ПараметрыЗаписи = Неопределено, ТекстОшибки = "", Отказ = Ложь) Экспорт 

	// Перенаправка в модуль менеджера объекта
	Возврат ОбщиеМетодыОбъектов_ШаблонМодуляМенеджера.СоздатьОбъект(СтруктураОбъекта, ДополнительныеСвойства, ПараметрыЗаписи, ТекстОшибки, Отказ);
	
КонецФункции

// ОбновитьОбъект
// Интерфейс для обновления и записи объекта по переданной Ссылке на Сервере.
//
// Параметры:
//  Ссылка						- Ссылка - ссылка на изменяемый объект.
//  СтруктураИзмененийОбъекта	- Структура - содержит изменяемые реквизиты и табличные части объекта (см. функцию ОбщиеМетодыОбъектовВызовСервера.СтруктураОбъекта).
//  ДополнительныеСвойства		- Структура - значения для заполнения одноименной структуры объекта,
//  							используется в случаях, когда необходимо хранить некоторые значения, связанные с объектом,
//  							на время выполнения некоторых операций, без изменения объекта.
//  ПараметрыЗаписи				- Структура - параметры для записи документов (режим записи и режим проведения).
//  ОчищатьТЧ					- Булево - если Истина, то перед добавлением строк в указанные в структуре табличные части последние будут очищены.
//  ТекстОшибки					- Строка - содержит описание ошибки, в случае возникновения оной.
//  Отказ						- Булево - признак возникновения ошибки выполнения.
//
// Возвращаемое значение:
//  Ссылка						- ссылка на измененный объект.
//  Неопределено				- в случае ошибки записи.
//
Функция ОбновитьОбъект(Ссылка,
	СтруктураИзмененийОбъекта,
	ДополнительныеСвойства = Неопределено,
	ПараметрыЗаписи = Неопределено,
	ОчищатьТЧ = Истина,
	ТекстОшибки = "",
	Отказ = Ложь) Экспорт
			
	// Перенаправка в модуль менеджера объекта
	Возврат ОбщиеМетодыОбъектов_ШаблонМодуляМенеджера.ОбновитьОбъект(Ссылка,
														СтруктураИзмененийОбъекта,
														ДополнительныеСвойства,
														ПараметрыЗаписи,
														ОчищатьТЧ,
														ТекстОшибки,
														Отказ);

КонецФункции

// ПараметрыЗаписиДокумента
// Интерфейс для получения структуры параметров для записи документов на Сервере.
//
// Параметры:
//  РежимЗаписи		- РежимЗаписиДокумента - позволяет выбрать один из возможных режимов записи.
//  РежимПроведения	- РежимПроведенияДокумента - позволяет выбрать один из возможных режимов проведения.
//
// Возвращаемое значение:
//  Структура		- параметры для записи документа.
//
Функция ПараметрыЗаписиДокумента(Знач РежимЗаписи = Неопределено, Знач РежимПроведения = Неопределено) Экспорт
	
	// Перенаправка в модуль менеджера объекта
	Возврат ОбщиеМетодыОбъектов_ШаблонМодуляМенеджера.ПараметрыЗаписиДокумента(РежимЗаписи, РежимПроведения);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеМетодыОбъектов

// СоздатьОбъектБезЗаписи
// Интерфейс для создания объекта по переданной структуре параметров на Сервере без записи.
//
// Параметры:
//  СтруктураОбъекта		- Структура - см. функцию ОбщиеМетодыОбъектовВызовСервера.СтруктураОбъекта.
//  ДополнительныеСвойства	- Структура - значения для заполнения одноименной структуры объекта,
//  						используется в случаях, когда необходимо хранить некоторые значения, связанные с объектом,
//  						на время выполнения некоторых операций, без изменения объекта.
//  ПараметрыЗаписи			- Структура - параметры для записи документов (режим записи и режим проведения).
//  ТекстОшибки				- Строка - содержит описание ошибки, в случае возникновения оной.
//  Отказ					- Булево - признак возникновения ошибки выполнения.
//
// Возвращаемое значение:
//  Объект					- созданный объект.
//  Неопределено			- в случае возникновения ошибки.
//
Функция СоздатьОбъектБезЗаписи(СтруктураОбъекта, ДополнительныеСвойства = Неопределено, ТекстОшибки = "", Отказ = Ложь) 

	// Перенаправка в модуль менеджера объекта
	Возврат ОбщиеМетодыОбъектов_ШаблонМодуляМенеджера.СоздатьОбъектБезЗаписи(СтруктураОбъекта, ДополнительныеСвойства, ТекстОшибки, Отказ);
			
КонецФункции

// ОбновитьОбъектБезЗаписи
// Интерфейс для обновления объекта по переданной Ссылке на Сервере без записи.
//
// Параметры:
//  Ссылка						- Ссылка - ссылка на изменяемый объект.
//  СтруктураИзмененийОбъекта	- Структура - содержит изменяемые реквизиты и табличные части объекта (см. функцию ОбщиеМетодыОбъектовВызовСервера.СтруктураОбъекта).
//  ДополнительныеСвойства		- Структура - значения для заполнения одноименной структуры объекта,
//  							используется в случаях, когда необходимо хранить некоторые значения, связанные с объектом,
//  							на время выполнения некоторых операций, без изменения объекта.
//  ПараметрыЗаписи				- Структура - параметры для записи документов (режим записи и режим проведения).
//  ОчищатьТЧ					- Булево - если Истина, то перед добавлением строк в указанные в структуре табличные части последние будут очищены.
//  ТекстОшибки					- Строка - содержит описание ошибки, в случае возникновения оной.
//  Отказ						- Булево - признак возникновения ошибки выполнения.
//
// Возвращаемое значение:
//  Объект						- измененный объект.
//  Неопределено				- в случае возникновения ошибки.
//
Функция ОбновитьОбъектБезЗаписи(Ссылка, 
	СтруктураИзмененийОбъекта, 
	ДополнительныеСвойства = Неопределено, 	
	ОчищатьТЧ = Истина, 
	ТекстОшибки = "", 
	Отказ = Ложь)
	
	// Перенаправка в модуль менеджера объекта	
	Возврат ОбщиеМетодыОбъектов_ШаблонМодуляМенеджера.ОбновитьОбъектБезЗаписи(Ссылка,
														СтруктураИзмененийОбъекта,
														ДополнительныеСвойства,
														ОчищатьТЧ,
														ТекстОшибки,
														Отказ);

КонецФункции

// ЗаписатьОбъект
// Записывает переданный объект в БД.
//
// Параметры:
//  Объект						- Объект - изменяемый объект.
//  ПараметрыЗаписи				- Структура - параметры для записи документов (режим записи и режим проведения).
//  ТекстОшибки					- Строка - содержит описание ошибки, в случае возникновения оной.
//  Отказ						- Булево - признак возникновения ошибки выполнения.
//
// Возвращаемое значение:
//  Ссылка						- ссылка на записанный объект.
//  Неопределено				- в случае возникновения ошибки записи.
//
Функция ЗаписатьОбъект(Объект, ПараметрыЗаписи = Неопределено, ТекстОшибки = "", Отказ = Ложь)
	
	// Перенаправка в модуль менеджера объекта
	Возврат ОбщиеМетодыОбъектов_ШаблонМодуляМенеджера.ЗаписатьОбъект(Объект, ПараметрыЗаписи, ТекстОшибки, Отказ);

КонецФункции

#КонецОбласти

#КонецОбласти

