
&НаКлиенте
Процедура СоздатьГруз(Команда)
	СоздатьГрузНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьГрузНаСервере()
	
	//оГруз = Документы.споГруз.СоздатьДокумент();
	//оГруз.Город = Объект.Ссылка;
	//ГородПолучатель = ?(Объект.Ссылка.Наименование = "Москва Восток", Справочники.споФилиалы.НайтиПоНаименованию("Санкт-Петербург"), Справочники.споФилиалы.НайтиПоНаименованию("Москва Восток"));
	//Попытка
	//	оГруз.Записать();
	//Исключение
	//	Сообщить(ОписаниеОшибки());
	//КонецПопытки;
	
	ГородПолучатель = ?(Объект.Ссылка.Наименование = "Москва Восток", Справочники.споФилиалы.НайтиПоНаименованию("Санкт-Петербург"), Справочники.споФилиалы.НайтиПоНаименованию("Москва Восток"));
	
	ОбъектФилиал = РеквизитФормыВЗначение("Объект");
	ОбъектФилиал.СоздатьГрузСУпаковкой(Объект.Ссылка, ГородПолучатель);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГрузИПоменятьГородаМестами(Команда)
	СоздатьГрузИПоменятьГородаМестамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьГрузИПоменятьГородаМестамиНаСервере()
	
	//оГруз = Документы.споГруз.СоздатьДокумент();
	//оГруз.Город = Объект.Ссылка;
	//ГородПолучатель = ?(Объект.Ссылка.Наименование = "Москва Восток", Справочники.споФилиалы.НайтиПоНаименованию("Санкт-Петербург"), Справочники.споФилиалы.НайтиПоНаименованию("Москва Восток"));
	////оГруз.ГородПолучатель = //Пустой
	//Попытка
	//	оГруз.Записать();
	//Исключение
	//	Сообщить(ОписаниеОшибки());
	//КонецПопытки;
	
	ГородПолучатель = ?(Объект.Ссылка.Наименование = "Москва Восток", Справочники.споФилиалы.НайтиПоНаименованию("Санкт-Петербург"), Справочники.споФилиалы.НайтиПоНаименованию("Москва Восток"));
	
	ОбъектФилиал = РеквизитФормыВЗначение("Объект");
	ОбъектФилиал.СоздатьГрузСУпаковкойИПоменятьГородаМестами(Объект.Ссылка, ГородПолучатель);

КонецПроцедуры
